package by.bkug.data

import org.intellij.lang.annotations.Language

@Language("markdown")
val meetup5 = """
Встреча нашего сообщества состоится 19 июля, как обычно в [Space](http://eventspace.by).

## Программа:

### Приветственный кофе (18:40 - 19:00)

Вас ждут печеньки, чай и кофе.

### Kotlin: MAX PAYNE - Артур Дрёмов (19:00 - 19:50)

Котлин даёт множество преимуществ, но мало кто знает о количестве боли, которую он периодически причиняет. Этот доклад — собрание неприятных особенностей языка и его инфраструктуры на основе двухлетнего опыта разработки исключительно на Котлине. Баги, фичи, производительность — затронем самые жесточайшие факторы и расскажем, как с этим живём мы

![Артур Дрёмов](https://bkug.by/wp-content/uploads/2017/07/artur_dryomov-150x150.jpg)

_Артур Дрёмов, Андроид-разработчик в Juno._


### Kotlin Coroutines - Руслан Ибрагимов (20:00 - 20:50)

Корутины которые появились в релизе 1.1 за флагом начинают использоваться в проектах, а у новичков возникает много вопросов что это, зачем и как пользоваться. Ответить на эти вопросы призван этот доклад. В докладе будет примеры использования корутин, обзор стандартной библиотеки, а также будет разобрано, как же корутины работают на самом низком уровне.

![Руслан Ибрагимов](https://bkug.by/wp-content/uploads/2017/07/ruslan_ibragimov-150x150.jpg)

_Руслан Ибрагимов, Full-Stack разработчик в ObjectStyle._

* **Дата проведения**: 19 июля
* **Время**: 19:00–21:00
* **Место проведения**: ул. Октябрьская, 16А – EventSpace. Парковка и вход через ул. Октябрьскую, 10б.

[Добавить в Google Calendar](http://www.google.com/calendar/event?action=TEMPLATE&dates=20170719T160000Z%2F20170719T180000Z&text=BKUG%20%235&location=%D0%9C%D0%B8%D0%BD%D1%81%D0%BA%2C%20%D1%83%D0%BB.%20%D0%9E%D0%BA%D1%82%D1%8F%D0%B1%D1%80%D1%8C%D1%81%D0%BA%D0%B0%D1%8F%2016%D0%B0%2C%20EventSpace&details=%D0%90%D0%BD%D0%BE%D0%BD%D1%81%20%D0%BD%D0%B0%20%D1%81%D0%B0%D0%B9%D1%82%D0%B5%20%D1%81%D0%BE%D0%BE%D0%B1%D1%89%D0%B5%D1%81%D1%82%D0%B2%D0%B0%20https%3A%2F%2Fbkug.by%2F2017%2F07%2F17%2Fanons-bkug-5%2F)

Для участия во встрече необходима предварительная [регистрация](https://goo.gl/forms/eVLmvIJerYDCkGnM2).

Митап пройдет при поддержке компании [Juno](https://gojuno.com/).

`[huge_it_maps id="2"]`

""".trimIndent()
